Revit 2024 API
FabricSheetType.IsValidMajorLapSplice Method
 Identifies if the input value is valid to be applied as the major lap splice value for this FabricSheetType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidMajorLapSplice(
	double majorLapSplice
)
Visual Basic
Public Function IsValidMajorLapSplice ( _
	majorLapSplice As Double _
) As Boolean
Visual C++
public:
bool IsValidMajorLapSplice(
	double majorLapSplice
)
Parameters
majorLapSplice
Type: System.Double
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace